NAME: Priya Gawhane

Implement Logistic Regression using Python\R to perform classification on Social_,Network_ads.csv dataset (kaggle link :https://www.kaggle.com/datasets/rakeshrau/social-network-ads/data)

Compute confusion matrix to find TP, FP, TN, FN,Accuracy ,Error rate, Precision

Recall on the given dataset.

In [1]:
#Importing the dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#data collection and preprocessesing
df = pd.read_csv('Social_Network_Ads.csv')

In [4]:
#printing the first 7 columns and rows
df.head(7)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0

In [5]:
#printing the first 9 columns and rows
df.tail(8)

      User ID  Gender  Age  EstimatedSalary  Purchased
392  15748589  Female   45            45000          1
393  15635893    Male   60            42000          1
394  15757632  Female   39            59000          0
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [6]:
#getting the totalcount of rows and columns
df.shape

(400, 5)

In [7]:
#Checking the missing values
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [ ]:
#Mapping gender column in numerical form
mapping = {'Male': 1, 'Female': 0}
df['gender'] = df['Gender'].map(mapping)